package ru.vsu.cs.galimov.tasks;

public class Main {

    // Взять задачу, пробовать писать
    // 1) остов приложения, бизнес логика, доменная часть, архитектура
    // данные хардкод, in memory хранилище, singleton,
    // ui консольный интерфейс, но не голое приложение
    // 2) та же задача, in memory переписывается, на бд
    // in memory -> database, желательно поменять один пакет
    // 3) переписать UI, servlet, в локалхосте показать работу с бд
    // 1-2 JAR tomcat
    // автоматы будут, 36 и больше
    // зачет без оценки
    // DI dependency injection
    // 2х фазные конструкторы, прокси
    // можно использовать библиотеку для поднятия синглтонов,прокси - reflections
    // jstl

    // 13. Товары в магазине.
    //Отдел: название, часы работы.
    //Товар: название, цена.
    //- Добавлять отдел/товары,
    //- удалять отдел/товары,
    //- редактировать отдел/товары.
    // Показывать товары в отделе, отделы без товаров, весь список товаров в магазине.

    public static void main(String[] args) {

    }
}
